-- Создание таблицы "Абонент"
CREATE TABLE Abonent (
    ID INT PRIMARY KEY,
    LastName NVARCHAR(50),
    PhoneNumber NVARCHAR(15),
    MonthlyPayment DECIMAL(10, 2)
);

-- Создание таблицы "Регистрация оплаты"
CREATE TABLE PaymentRegistration (
    ID INT PRIMARY KEY,
    LastName NVARCHAR(50),
    PhoneNumber NVARCHAR(15),
    PaymentDate DATE,
    MonthlyPayment DECIMAL(10, 2),
    PaymentAmount DECIMAL(10, 2),
    DebtOrOverpayment DECIMAL(10, 2)
);

-- Внесение исходных данных в таблицу "Абонент"
INSERT INTO Abonent (ID, LastName, PhoneNumber, MonthlyPayment)
VALUES (1, 'Иванов', '+79001234567', 1000),
       (2, 'Петров', '+79002345678', 1500),
       (3, 'Сидоров', '+79003456789', 2000),
       (4, 'Кузнецов', '+79004567890', 2500),
       (5, 'Соколов', '+79005678901', 3000),
       (6, 'Попов', '+79006789012', 3500),
       (7, 'Васильев', '+79007890123', 4000);

-- Внесение исходных данных в таблицу "Регистрация оплаты"
INSERT INTO PaymentRegistration (ID, LastName, PhoneNumber, PaymentDate, MonthlyPayment, PaymentAmount, DebtOrOverpayment)
VALUES (1, 'Иванов', '+79001234567', '2022-01-01', 1000, 1000, 0),
       (2, 'Петров', '+79002345678', '2022-01-01', 1500, 1500, 0),
       (3, 'Сидоров', '+79003456789', '2022-01-01', 2000, 2000, 0),
       (4, 'Кузнецов', '+79004567890', '2022-01-01', 2500, 2500, 0),
       (5, 'Соколов', '+79005678901', '2022-01-01', 3000, 3000, 0),
       (6, 'Попов', '+79006789012', '2022-01-01', 3500, 3500, 0),
       (7, 'Васильев', '+79007890123', '2022-01-01', 4000, 4000, 0),
       (8, 'Иванов', '+79001234567', '2022-02-01', 1000, 1000, 0),
       (9, 'Петров', '+79002345678', '2022-02-01', 1500, 1500, 0),
       (10, 'Сидоров', '+79003456789', '2022-02-01', 2000, 2000, 0);